#from here loaded islamic 

from SHRU.Config import roza_config 

razan = [
"""
#اذكار_الصباح
«أعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ»

- ٣ مرَّات.

-----------------------‐

«اللَّهُمَّ بِكَ أمْسَيْنَا ، وَبِكَ أصْبَحْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإلَيْكَ المَصِيرُ»

-----------------------‐

«اللَّهُمَّ مَا أمْسَى بِي مِنْ نِعْمَةٍ أوْ بِأحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ ، فَلَكَ الحَمْدُ وَلَكَ الشُّكْرُ»

-----------------------‐

«اللَّهُمَّ إنِّي أمْسَيْتُ أُشْهِدُكَ ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ ، وَمَلَائِكَتَكَ ، وَجَمِيعَ خَلْقِكَ ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إلَّا أنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ ، وَأنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ»

- ٤ مرَّات.

-----------------------‐

«أمْسَيْنَا وَأمْسَى المُلْكُ للهِ رَبِّ العَالَمِينَ ،
اللَّهُمَّ إنِّي أسْألُكَ خَيْرَ هَذِهِ اللَّيْلَةِ ، فَتْحَهَا ، وَنَصْرَهَا ، وَنُورَهَا ، وَبَرَكَتَهَا ، وَهُدَاهَا ، وَأعُوذُ بِكَ مِنْ شَرِّ مَا فِيهَا وَشَرِّ مَا بَعْدَهَا»

-----------------------‐

«أمْسَيْنَا عَلَى فِطْرَةِ الإسْلَامِ ، وَعَلَى كَلِمَةِ الإخْلَاصِ ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، وَعَلَى مِلَّةِ أبِينَا إبْرَاهِيمَ ، حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ المُشْرِكِينَ»

-----------------------‐

«أمْسَيْنَا وأمْسَى المُلْكُ للهِ والحَمْدُ للهِ ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ،
رَبِّ أسْألُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا ، وَأعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلةِ وَشَرِّ مَا بَعْدَهَا ،
رَبِّ أعُوذُ بِكَ مِنَ الكَسَلِ وَسُوءِ الكِبَرِ ، رَبِّ أعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي القَبْرِ» .
""",
]



roz = [
"""
#اذكار_المساء
«الحَمْدُ للهِ وَحْدَهُ ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى مَنْ لَا نَبِيَّ بَعْدَهُ»

-----------------------‐

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾

-----------------------‐

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ هُوَ اللهُ أَحَدٌ ۝ اللهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ﴾

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ أَعُوذُ بِرَبِّ الفَلَقِ ۝ مِن شَرِّ مَا خَلَقَ ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي العُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَهِ النَّاسِ ۝ مِن شَرِّ الوَسْوَاسِ الخَنَّاسِ ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الجِنَّةِ وَالنَّاسِ﴾

-----------------------‐

«أصْبَحْنَا وَأصْبَحَ المُلْكُ للهِ والحَمْدُ للهِ ، لَا إلهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ،
رَبِّ أسْألُكَ خَيْرَ مَا فِي هَذَا اليَوْمِ وَخَيْرَ مَا بَعْدَهُ ، وَأعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا اليَوْمِ وَشَرِّ مَا بَعْدَهُ ،
رَبِّ أعُوذُ بِكَ مِنَ الكَسَلِ وَسُوءِ الكِبَرِ ، رَبِّ أعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وعَذَابٍ فِي القَبْرِ»

- وإذا أمسى يقول :

«أمْسَيْنَا وأمْسَى المُلْكُ للهِ والحَمْدُ للهِ ، لَا إلهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ،
رَبِّ أسْألُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا ، وَأعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلةِ وَشَرِّ مَا بَعْدَهَا ،
رَبِّ أعُوذُ بِكَ مِنَ الكَسَلِ وَسُوءِ الكِبَرِ ، رَبِّ أعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي القَبْرِ»

-----------------------‐

«اللَّهُمَّ بِكَ أصْبَحْنَا ، وَبِكَ أمْسَيْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإلَيْكَ النُّشُورُ»

- وإذا أمسى يقول :

«اللَّهُمَّ بِكَ أمْسَيْنَا ، وَبِكَ أصْبَحْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإلَيْكَ المَصِيرُ»

-----------------------‐

«اللَّهُمَّ أنْتَ رَبِّي لَا إلَهَ إلَّا أنْتَ ،
خَلَقْتَنِي وَأنَا عَبْدُكَ ، وَأنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ،
أبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأبُوءُ بِذَنْبِي فَاغْفِرْ لِي ؛ فَإنَّهُ لَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ»

-----------------------‐

«اللَّهُمَّ إنِّي أصْبَحْتُ أُشْهِدُكَ ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ ، وَمَلائِكَتَكَ ، وَجَمِيعَ خَلْقِكَ ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إلَّا أنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ ، وَأنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ»

- ٤ مرَّات.

- وإذا أمسى يقول :

«اللَّهُمَّ إنِّي أمْسَيْتُ أُشْهِدُكَ ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ ، وَمَلائِكَتَكَ ، وَجَمِيعَ خَلْقِكَ ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إلَّا أنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ ، وَأنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ»

- ٤ مرَّات.

-----------------------‐

«اللَّهُمَّ مَا أصْبَحَ بِي مِنْ نِعْمَةٍ أوْ بِأحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ ، فَلَكَ الحَمْدُ وَلَكَ الشُّكْرُ»

- وإذا أمسى يقول :

«اللَّهُمَّ مَا أمْسَى بِي مِنْ نِعْمَةٍ أوْ بِأحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ ، فَلَكَ الحَمْدُ وَلَكَ الشُّكْرُ»

-----------------------‐

«اللَّهُمَّ عَافِنِي فِي بَدَنِي ، اللَّهُمَّ عَافِنِي فِي سَمْعِي ، اللَّهُمَّ عَافِنِي فِي بَصَرِي ، لَا إلَهَ إلَّا أنْتَ ،
اللَّهُمَّ إنِّي أعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ ، وَأعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ ، لَا إلَهَ إلَّا أنْتَ»

- ٣ مرَّات.
"""
]

roza = [
"""
#احاديث
بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾

((مَنْ قَالَهَا حِينَ يُصْبِحُ أُجِيرَ مِنَ الجِنِّ حَتَّى يُمْسِي ، وَمَنْ قَالَهَا حِينَ يُمْسِي أُجِيرَ مِنْهُمْ حَتَّى يُصْبِحَ))

أخرجه الحاكم ، وصححه الألباني في صحيح الترغيب والترهيب.

-----------------------‐

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ هُوَ اللهُ أَحَدٌ ۝ اللهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ﴾

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ أَعُوذُ بِرَبِّ الفَلَقِ ۝ مِن شَرِّ مَا خَلَقَ ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي العُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَهِ النَّاسِ ۝ مِن شَرِّ الوَسْوَاسِ الخَنَّاسِ ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الجِنَّةِ وَالنَّاسِ﴾

((مَنْ قَالَهَا ثَلَاثَ مَرَّاتٍ حِينَ يُصْبِحُ وَحِينَ يُمْسِي كَفَتْهُ مِنْ كُلِّ شَيْءٍ))

أخرجه أبو داود ، والترمذي في صحيح الترمذي.

-----------------------‐

«اللَّهُمَّ أنْتَ رَبِّي لَا إلَهَ إلَّا أنْتَ ،
خَلَقْتَنِي وَأنَا عَبْدُكَ ، وَأنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ،
أبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأبُوءُ بِذَنْبِي فَاغْفِرْ لِي ؛ فَإنَّهُ لَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ»

((مَنْ قَالَهَا مُوقِنًا بِهَا حِينَ يُمْسِي فَمَاتَ مِنْ لَيْلَتِهِ دَخَلَ الجَنَّةَ ، وَكَذَلِكَ إذَا أصْبَحَ))

أخرجه البخاري.

-----------------------‐

«اللَّهُمَّ إنِّي أصْبَحْتُ أُشْهِدُكَ ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ ، وَمَلائِكَتَكَ ، وَجَمِيعَ خَلْقِكَ ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إلَّا أنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ ، وَأنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ»

- وإذا أمسى يقول :

«اللَّهُمَّ إنِّي أمْسَيْتُ أُشْهِدُكَ ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ ، وَمَلائِكَتَكَ ، وَجَمِيعَ خَلْقِكَ ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إلَّا أنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ ، وَأنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ»

- ٤ مرَّات.

((مَنْ قَالَهَا حِينَ يُصْبِحُ أوْ يُمْسِي أرْبَعَ مَرَّاتٍ أعْتَقَهُ اللهُ مِنَ النَّارِ))

أخرجه أبو داود ، والبخاري في الأدب المفرد ، والنسائي في عمل اليوم والليلة ، وابن السني.

-----------------------‐

«اللَّهُمَّ مَا أصْبَحَ بِي مِنْ نِعْمَةٍ أوْ بِأحَدٍ مِنْ خَلقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ ، فَلَكَ الحَمْدُ وَلَكَ الشُّكْرُ»

- وإذا أمسى يقول :

«اللَّهُمَّ مَا أمْسَى بِي مِنْ نِعْمَةٍ أوْ بِأحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ ، فَلَكَ الحَمْدُ وَلَكَ الشُّكْرُ»

((مَنْ قَالَهَا حِينَ يُصْبِحُ فَقَدْ أدَّى شُكْرَ يَوْمِهِ ، وَمَنْ قَالَهَا حِينَ يُمْسِي فَقَدْ أدَّى شُكْرَ لَيلَتِهِ))

أخرجه أبو داود ، والنسائي في عمل اليوم والليلة ، وابن السني ، وابن حبان.

-----------------------‐

«حَسْبِيَ اللهُ لَا إلَهَ إلَّا هُوَ عَلَيْهِ تَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ»

((مَنْ قَالَهَا حِينَ يُصْبِحُ وَحِينَ يُمْسِي سَبْعَ مَرَّاتٍ كَفَاهُ اللهُ مَا أهَمَّهُ مِنْ أمْرِ الدُّنْيَا وَالآخِرَةِ))

أخرجه ابن السني مرفوعًا ، وأبو داود موقوفًا.

-----------------------‐

«بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأرْضِ وَلَا فِي السَّماءِ وَهُوَ السَّمِيعُ العَلِيمُ»

((مَنْ قَالَهَا ثَلَاثًا إذَا أصْبَحَ ، وَثَلَاثًا إذَا أمْسَى ، لَمْ يَضُرَّهُ شَيْءٌ))

أخرجه أبو داود ، والترمذي ، وابن ماجه ، وأحمد.

-----------------------‐

«رَضِيتُ بِاللهِ رَبًّا ، وَبِالإسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا»

((مَنْ قَالَهَا ثَلَاثًا حِينَ يُصْبِحُ ، وَثَلَاثًا حِينَ يُمْسِي ، كَانَ حَقًّا عَلَى اللهِ أنْ يُرْضِيَهُ يَوْمَ القِيَامَةِ))

أخرجه أحمد ، والنسائي في عمل اليوم والليلة ، وابن السني ، وأبو داود ، والترمذي.
""",
]

rozan = [
"""
#أذكار_الاستيقاظ

«الحَمْدُ لِلهِ الَّذِي أحْيَانَا بَعْدَ مَا أمَاتَنَا وَإلَيْهِ النُّشُورُ»

-----------------------‐

«لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ المُلْكُ ، وَلَهُ الحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ،
سُبْحَانَ اللهِ ، وَالحَمْدُ للهِ ، وَلَا إلَهَ إلَّا اللهُ ، وَاللهُ أكْبَرُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إلَّا بِاللهِ العَلِيِّ العَظِيمِ ، رَبِّ اغْفِرْ لِي»

-----------------------‐

«الحَمْدُ لِلهِ الَّذِي عَافَانِي فِي جَسَدِي ، وَرَدَّ عَلَيَّ رُوحِي ، وَأذِنَ لِي بِذِكْرِهِ»

-----------------------‐

﴿إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِّأُولِي الْأَلْبَابِ ۝ الَّذِينَ يَذْكُرُونَ اللهَ قِيَامًا وَقُعُودًا وَعَلَى جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ ۝ رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ ۝ رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ ۝ رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ ۝ فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَى بَعْضُكُم مِّن بَعْضٍ فَالَّذِينَ هَاجَرُوا وَأُخْرِجُوا مِن دِيَارِهِمْ وَأُوذُوا فِي سَبِيلِي وَقَاتَلُوا وَقُتِلُوا لَأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلَأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ثَوَابًا مِّنْ عِندِ اللهِ وَاللهُ عِندَهُ حُسْنُ الثَّوَابِ ۝ لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا فِي الْبِلَادِ ۝ مَتَاعٌ قَلِيلٌ ثُمَّ مَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمِهَادُ ۝ لَكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا نُزُلًا مِّنْ عِندِ اللهِ وَمَا عِندَ اللهِ خَيْرٌ لِّلْأَبْرَارِ ۝ وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَن يُؤْمِنُ بِاللهِ وَمَا أُنزِلَ إِلَيْكُمْ وَمَا أُنزِلَ إِلَيْهِمْ خَاشِعِينَ لِلهِ لَا يَشْتَرُونَ بِآيَاتِ اللهِ ثَمَنًا قَلِيلًا أُولَئِكَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ إِنَّ اللهَ سَرِيعُ الْحِسَابِ ۝ يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللهَ لَعَلَّكُمْ تُفْلِحُونَ﴾
""",
]

rozmuh = [
"""
#اذكار_النوم
- يجمع كفيه ثم ينفُثُ فيهما فيقرأ فيهما :

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ هُوَ اللهُ أَحَدٌ ۝ اللهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ﴾

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ أَعُوذُ بِرَبِّ الفَلَقِ ۝ مِن شَرِّ مَا خَلَقَ ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي العُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَهِ النَّاسِ ۝ مِن شَرِّ الوَسْوَاسِ الخَنَّاسِ ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الجِنَّةِ وَالنَّاسِ﴾ 

ثم يمسح بهما ما استطاع من جسده ، يبدأ بهما على رأسه ووجهه وما أقبل من جسده.

- يفعل ذلك ثلاث مرَّات.

-----------------------‐

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾

-----------------------‐

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ۝ لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾

-----------------------‐

«بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي ، وَبِكَ أرْفَعُهُ ، إنْ أمْسَكْتَ نَفْسِي فَارْحَمْهَا ، وَإِنْ أرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ»

-----------------------‐

«اللَّهُمَّ خَلَقْتَ نَفْسِي، وَأنْتَ تَوَفَّاهَا ، لَكَ مَمَاتُهَا وَمَحْيَاهَا ، إنْ أحْيَيْتَهَا فَاحْفَظْهَا ، وَإنْ أمَتَّهَا فَاغْفِرْ لَهَا ، اللَّهُمَّ إنِّي أسْألُكَ العَافِيَةَ»

-----------------------‐

كان ﷺ إذا أراد أن يرقد وضع يده اليمنى تحت خده ثم يقول :

«اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ»

-----------------------‐

«بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا»

-----------------------‐

- «سُبْحَانَ اللهِ» (٣٣ مرَّة) ،
- «الْحَمْدُ لِلهِ» (٣٣ مرَّة) ،
- «اللهُ أَكْبَرُ» (٣٤ مرَّة).

-----------------------‐

«اللَّهُمَّ رَبَّ السَّمَاوَاتِ وَرَبَّ الأَرْضِ وَرَبَّ العَرْشِ الْعَظِيمِ ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ ، فَالِقَ الحَبِّ وَالنَّوَى ، وَمُنْزِلَ التَّوْرَاةِ وَالإنْجِيلِ وَالفُرْقَانِ ، أعُوذُ بِكَ مِنْ شَرِّ كُلِّ شيء أنْتَ آخِذٌ بِنَاصِيَتِهِ ،
اللَّهُمَّ أنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ ، وَأَنْتَ البَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ ، اقْضِ عَنَّا الدَّيْنَ وَأغْنِنَا مِنَ الفَقْرِ»

-----------------------‐

«الحَمْدُ لِلهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَآوَانَا ؛ فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُئْوِيَ»

-----------------------‐

«اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ ، فَاطِرَ السَّمَاوَاتِ وَالأرْضِ ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أشْهَدُ أن لَّا إلَهَ إلَّا أنْتَ ،
أعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيطَانِ وشِرْكِهِ ، وَأنْ أقْتَرِفَ عَلَى نَفْسِي سُوءًا ، أوْ أجُرَّهُ إلَى مُسْلِمٍ»
""",
]


rzane = [
"""
#الأذكاربعدالصلاة

«اللَّهُمَّ إنِّي أسْألُكَ عِلْمًا نَافِعًا ، وَرِزْقًا طَيِّبًا ، وَعَمَلًا مُتَقَبَّلًا»

- بعد السلام من صلاة الفجر.

-----------------------‐

«أسْتَغْفِرُ اللهَ ، أسْتَغْفِرُ اللهَ ، أسْتَغْفِرُ اللهَ»

-----------------------‐

«اللَّهُمَّ أنْتَ السَّلاَمُ ، وَمِنْكَ السَّلاَمُ ، تَبَارَكْتَ يَا ذَا الجَلاَلِ وَالإكْرَامِ»

-----------------------‐

«لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ المُلْكُ ، وَلَهُ الحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ،
اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الجَدِ مِنْكَ الجَدُّ»

-----------------------‐

«لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ المُلْكُ ، وَلَهُ الحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ،
لَاحَوْلَ وَلَا قُوَّةَ إلَّا بِاللهِ ، لَا إلَهَ إلَّا اللهُ ، وَلَا نَعْبُدُ إلَّا إيَّاهُ ، لَهُ النِّعْمَةُ وَلَهُ الفَضْلُ وَلَهُ الثَّنَاءُ الحَسَنُ ،
لَا إلَهَ إلَّا اللهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الكَافِرُونَ»

-----------------------‐

«اللَّهُمَّ أعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ»

-----------------------‐

- «سُبْحَانَ اللهِ» (٣٣ مرَّة) ،
- «الْحَمْدُ لِلهِ» (٣٣ مرَّة) ،
- «اللهُ أَكْبَرُ» (٣٣ مرَّة) ،
- «لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ المُلْكُ ، وَلَهُ الحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ»

-----------------------‐

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ هُوَ اللهُ أَحَدٌ ۝ اللهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ﴾

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ أَعُوذُ بِرَبِّ الفَلَقِ ۝ مِن شَرِّ مَا خَلَقَ ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي العُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَهِ النَّاسِ ۝ مِن شَرِّ الوَسْوَاسِ الخَنَّاسِ ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الجِنَّةِ وَالنَّاسِ﴾

- بعد كل صلاة.

-----------------------‐

بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ :

﴿اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾

- عقب كل صلاة.

-----------------------‐

«لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ المُلْكُ ، وَلَهُ الحَمْدُ ، يُحْيِي وَيُمِيتُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ»

 - ١٠ مرَّات بعد صلاة المغرب والصبح.

""",
]
