
ALIVERZ = "**• امر الفحص **:\n\n- الوظيفة  : يستخدم للتاكد من فعالية البوت كأمر تجربة  \n\n- الاستخدام  :  ارسل في اي محادثه   `.فحص`"
Trfehn = "•❒ اوامـر ممتعـة للترفيـه\n\n`.اوصف`        .هينه`      `.كت`    `.نزوج`\n\n`.طلاك`    `.رفع مطي`    `.رفع زوجي`\n\n`.رفع مرتي`      `.رفع تاج`   `.نسبة الانوثة`\n\n`.نسبة الغباء`    `.نسبة الحب`   `.رفع قرد`\n\n`.رفع جلب`     `.رفع بكلبي`\n\nٴ╼──────────────────╾\n\nجميع هذه الاوامر تستخدم بالرد على المستخدم"
RAZAN = "**▾∮ يجب وضع اسم الاغنية اولا للبحث عنها", 15**"
