from SHRU import l313l

import random

from ..helpers.functions import edit_or_reply
plugin_category = "utils"
ashour = [
    "أَقِيمُوا الْعَزَاء اُذْكُرُوا سِّيِّد الشَّبَاب قتييل كَرْبَلا ءاِبْن عَلِيّ والزهراء",
    "سأمضي وما بالموت عارٌ على الفتى * إذا ما نوى حقاً وجاهد مسلمًا.",
    "فهل إلاّ الموت ؟ فمرحباً به",
    "أيّها الناس نافِسوا في المكارم وسارعوا في المغانِم.",
    "نَفْسِ مَنْ بَعْدِ الْحُسَيْن هَوِّنِي وَبَعْدَهُ لَا كُنْتِ أَوْ تَكُونِي",
    "هَذَا الْحُسَيْن شَارِب الْمَنُون وتشربين بَارِد الْمُعَيَّن",
    "هَيْهَاتَ مَا هَذَا فَعَّال دِينِي وَلَا فِعَالَ صَادِقٌ الْيَقِين",
    "وَاَللَّه لو قطعـتموا يمـيني",
    "يَا نَفْسُ لَا تخـشي مِن الكفار",
    "نَفْسِ مَنْ بَعْدِ الْحُسَيْن هَوِّنِي وَبَعْدَهُ لَا كُنْتِ أَوْ تَكُونِي",
]

@l313l.ar_cmd(
    pattern="عاشوراء$",
    command=("عاشوراء", plugin_category),
    info={
        "header": "Get random qusts about عاشوراء (Ashura).",
        "usage": "{tr}عاشوراء",
    },
)
async def ashura_info(event):
    ahsouralshen = random.choice(ashour)
    await edit_or_reply(event, ahsouralshen)